modm-ext/archive-stmicro-svd/header_stm32h747agi6@m4.svd
      <register>
        <name>CLRFRA</name>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRA</name>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRB</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRB</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRB</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRB</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRA</name>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRA</name>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRA</name>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRA</name>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRB</name>
        <addressOffset>0x78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRB</name>
        <addressOffset>0x78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRB</name>
        <addressOffset>0x78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRB</name>
        <addressOffset>0x78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRB</name>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRB</name>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRB</name>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRB</name>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>SAI2</name>
      <baseAddress>0x40015c00</baseAddress>
      <register>
        <name>GCR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SYNCIN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SYNCOUT</name>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CR1A</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1A</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1A</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1A</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2A</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2A</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2A</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2A</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRA</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRA</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRA</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRA</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRA</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRA</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRA</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRA</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1B</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1B</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1B</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1B</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2B</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2B</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2B</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2B</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRA</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRA</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRA</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRA</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRB</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRB</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRB</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRB</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRB</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRB</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRB</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRB</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRA</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRA</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRA</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRA</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>PDMCR</name>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PDMEN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MICNBR</name>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CKEN1</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CKEN2</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CKEN3</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CKEN4</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PDMDLY</name>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DLYM1L</name>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM1R</name>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM2L</name>
            <bitOffset>8</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM2R</name>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM3L</name>
            <bitOffset>16</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM3R</name>
            <bitOffset>20</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM4L</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM4R</name>
            <bitOffset>28</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IMRB</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRB</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRB</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRB</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRA</name>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRA</name>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRA</name>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRA</name>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRB</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRB</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRB</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRB</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRA</name>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRA</name>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRA</name>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRA</name>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRB</name>
        <addressOffset>0x78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRB</name>
        <addressOffset>0x78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRB</name>
        <addressOffset>0x78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRB</name>
        <addressOffset>0x78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRB</name>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRB</name>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRB</name>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRB</name>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>SAI3</name>
      <baseAddress>0x40016000</baseAddress>
      <register>
        <name>GCR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SYNCIN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>SYNCOUT</name>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CR1A</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1A</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1A</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1A</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2A</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2A</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2A</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2A</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRA</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRA</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRA</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRA</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRA</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRA</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRA</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRA</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1B</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1B</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1B</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1B</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2B</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2B</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2B</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2B</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRA</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRA</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRA</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRA</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRB</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRB</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRB</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FRCRB</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRB</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRB</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRB</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SLOTRB</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRA</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRA</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRA</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRA</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>PDMCR</name>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PDMEN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MICNBR</name>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>CKEN1</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CKEN2</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CKEN3</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CKEN4</name>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PDMDLY</name>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DLYM1L</name>
            <bitOffset>0</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM1R</name>
            <bitOffset>4</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM2L</name>
            <bitOffset>8</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM2R</name>
            <bitOffset>12</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM3L</name>
            <bitOffset>16</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM3R</name>
            <bitOffset>20</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM4L</name>
            <bitOffset>24</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DLYM4R</name>
            <bitOffset>28</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>IMRB</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRB</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRB</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IMRB</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRA</name>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRA</name>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRA</name>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRA</name>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRB</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRB</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRB</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SRB</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRA</name>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRA</name>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRA</name>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DRA</name>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CLRFRB</name>
        <addressOffset>0x78</addressOffset>
        <size>0x20</size>
      </register>
