modm-ext/archive-stmicro-svd/header_stm32h747agi6@m4.svd
      <register>
        <name>BGCLUT.219</name>
        <addressOffset>0xb6c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.220</name>
        <addressOffset>0xb70</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.221</name>
        <addressOffset>0xb74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.222</name>
        <addressOffset>0xb78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.223</name>
        <addressOffset>0xb7c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.224</name>
        <addressOffset>0xb80</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.225</name>
        <addressOffset>0xb84</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.226</name>
        <addressOffset>0xb88</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.227</name>
        <addressOffset>0xb8c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.228</name>
        <addressOffset>0xb90</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.229</name>
        <addressOffset>0xb94</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.230</name>
        <addressOffset>0xb98</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.231</name>
        <addressOffset>0xb9c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.232</name>
        <addressOffset>0xba0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.233</name>
        <addressOffset>0xba4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.234</name>
        <addressOffset>0xba8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.235</name>
        <addressOffset>0xbac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.236</name>
        <addressOffset>0xbb0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.237</name>
        <addressOffset>0xbb4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.238</name>
        <addressOffset>0xbb8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.239</name>
        <addressOffset>0xbbc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.240</name>
        <addressOffset>0xbc0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.241</name>
        <addressOffset>0xbc4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.242</name>
        <addressOffset>0xbc8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.243</name>
        <addressOffset>0xbcc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.244</name>
        <addressOffset>0xbd0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.245</name>
        <addressOffset>0xbd4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.246</name>
        <addressOffset>0xbd8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.247</name>
        <addressOffset>0xbdc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.248</name>
        <addressOffset>0xbe0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.249</name>
        <addressOffset>0xbe4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.250</name>
        <addressOffset>0xbe8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.251</name>
        <addressOffset>0xbec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.252</name>
        <addressOffset>0xbf0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.253</name>
        <addressOffset>0xbf4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.254</name>
        <addressOffset>0xbf8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.255</name>
        <addressOffset>0xbfc</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>FLASH</name>
      <baseAddress>0x52002000</baseAddress>
      <register>
        <name>ACR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>WRHIGHFREQ</name>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>KEYR1</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>OPTKEYR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR1</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SR1</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR1</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>OPTCR</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>OPTLOCK</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OPTSTART</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>MER</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OPTCHANGEERRIE</name>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWAP_BANK</name>
            <bitOffset>31</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>OPTSR_CUR</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>OPTSR_PRG</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>OPTCCR</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CLR_OPTCHANGEERR</name>
            <bitOffset>30</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>PRAR_CUR1</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>PRAR_PRG1</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SCAR_CUR1</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SCAR_PRG1</name>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>WPSN_CUR1</name>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>WPSN_PRG1</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BOOT7_CUR</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BOOT7_PRG</name>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BOOT4_CUR</name>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BOOT4_PRG</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CRCCR1</name>
        <addressOffset>0x50</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CRCSADD1</name>
        <addressOffset>0x54</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CRCEADD1</name>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CRCDATA</name>
        <addressOffset>0x5c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CRC_DATA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>ECC_FA1</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>KEYR2</name>
        <addressOffset>0x104</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CR2</name>
        <addressOffset>0x10c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SR2</name>
        <addressOffset>0x110</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CCR2</name>
        <addressOffset>0x114</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>PRAR_CUR2</name>
        <addressOffset>0x128</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>PRAR_PRG2</name>
        <addressOffset>0x12c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SCAR_CUR2</name>
        <addressOffset>0x130</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>SCAR_PRG2</name>
        <addressOffset>0x134</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>WPSN_CUR2</name>
        <addressOffset>0x138</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>WPSN_PRG2</name>
        <addressOffset>0x13c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CRCCR2</name>
        <addressOffset>0x150</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CRCSADD2</name>
        <addressOffset>0x154</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CRCEADD2</name>
        <addressOffset>0x158</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>CRCDATA2</name>
        <addressOffset>0x15c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>ECC_FA2</name>
        <addressOffset>0x160</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>JPEG</name>
      <baseAddress>0x52003000</baseAddress>
      <register>
        <name>CONFR0</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>START</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CONFR1</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>NF</name>
            <bitOffset>0</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>DE</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>COLORSPACE</name>
            <bitOffset>4</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NS</name>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>HDR</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>YSIZE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CONFR2</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>NMCU</name>
            <bitOffset>0</bitOffset>
            <bitWidth>26</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CONFR3</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>XSIZE</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CONFR4</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>HD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HA</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>QT</name>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NB</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>VSF</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>HSF</name>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CONFR5</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>HD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HA</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>QT</name>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NB</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>VSF</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>HSF</name>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CONFR6</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>HD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HA</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>QT</name>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NB</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>VSF</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>HSF</name>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CONFR7</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>HD</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HA</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>QT</name>
            <bitOffset>2</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>NB</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>VSF</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>HSF</name>
            <bitOffset>12</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CR</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>JCEN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>IFTIE</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>IFNFIE</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OFTIE</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OFNEIE</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOCIE</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HPDIE</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>IFF</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OFF</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SR</name>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>IFTF</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>IFNFF</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OFTF</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>OFNEF</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EOCF</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>HPDF</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>COF</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CFR</name>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>CEOCF</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CHPDF</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DIR</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DATAIN</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DOR</name>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DATAOUT</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>QMEM0.0</name>
        <addressOffset>0x50</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM0.1</name>
        <addressOffset>0x54</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM0.2</name>
        <addressOffset>0x58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM0.3</name>
        <addressOffset>0x5c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM0.4</name>
        <addressOffset>0x60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM0.5</name>
        <addressOffset>0x64</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM0.6</name>
        <addressOffset>0x68</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM0.7</name>
        <addressOffset>0x6c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM0.8</name>
        <addressOffset>0x70</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM0.9</name>
        <addressOffset>0x74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM0.10</name>
        <addressOffset>0x78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM0.11</name>
        <addressOffset>0x7c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM0.12</name>
        <addressOffset>0x80</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM0.13</name>
        <addressOffset>0x84</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM0.14</name>
        <addressOffset>0x88</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM0.15</name>
        <addressOffset>0x8c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM1.0</name>
        <addressOffset>0x90</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM1.1</name>
        <addressOffset>0x94</addressOffset>
        <size>0x20</size>
      </register>
