modm-ext/archive-stmicro-svd/header_stm32h747agi6@m4.svd
      <register>
        <name>HUFFSYMB.80</name>
        <addressOffset>0x350</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.81</name>
        <addressOffset>0x354</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.82</name>
        <addressOffset>0x358</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.83</name>
        <addressOffset>0x35c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.0</name>
        <addressOffset>0x360</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.1</name>
        <addressOffset>0x364</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.2</name>
        <addressOffset>0x368</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.3</name>
        <addressOffset>0x36c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.4</name>
        <addressOffset>0x370</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.5</name>
        <addressOffset>0x374</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.6</name>
        <addressOffset>0x378</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.7</name>
        <addressOffset>0x37c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.8</name>
        <addressOffset>0x380</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.9</name>
        <addressOffset>0x384</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.10</name>
        <addressOffset>0x388</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.11</name>
        <addressOffset>0x38c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.12</name>
        <addressOffset>0x390</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.13</name>
        <addressOffset>0x394</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.14</name>
        <addressOffset>0x398</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.15</name>
        <addressOffset>0x39c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.16</name>
        <addressOffset>0x3a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.17</name>
        <addressOffset>0x3a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.18</name>
        <addressOffset>0x3a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.19</name>
        <addressOffset>0x3ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.20</name>
        <addressOffset>0x3b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.21</name>
        <addressOffset>0x3b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.22</name>
        <addressOffset>0x3b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.23</name>
        <addressOffset>0x3bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.24</name>
        <addressOffset>0x3c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.25</name>
        <addressOffset>0x3c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.26</name>
        <addressOffset>0x3c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.27</name>
        <addressOffset>0x3cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.28</name>
        <addressOffset>0x3d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.29</name>
        <addressOffset>0x3d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.30</name>
        <addressOffset>0x3d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.31</name>
        <addressOffset>0x3dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.32</name>
        <addressOffset>0x3e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.33</name>
        <addressOffset>0x3e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.34</name>
        <addressOffset>0x3e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.35</name>
        <addressOffset>0x3ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.36</name>
        <addressOffset>0x3f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.37</name>
        <addressOffset>0x3f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.38</name>
        <addressOffset>0x3f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.39</name>
        <addressOffset>0x3fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.40</name>
        <addressOffset>0x400</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.41</name>
        <addressOffset>0x404</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.42</name>
        <addressOffset>0x408</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.43</name>
        <addressOffset>0x40c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.44</name>
        <addressOffset>0x410</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.45</name>
        <addressOffset>0x414</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.46</name>
        <addressOffset>0x418</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.47</name>
        <addressOffset>0x41c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.48</name>
        <addressOffset>0x420</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.49</name>
        <addressOffset>0x424</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.50</name>
        <addressOffset>0x428</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.51</name>
        <addressOffset>0x42c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.52</name>
        <addressOffset>0x430</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.53</name>
        <addressOffset>0x434</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.54</name>
        <addressOffset>0x438</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.55</name>
        <addressOffset>0x43c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.56</name>
        <addressOffset>0x440</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.57</name>
        <addressOffset>0x444</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.58</name>
        <addressOffset>0x448</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.59</name>
        <addressOffset>0x44c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.60</name>
        <addressOffset>0x450</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.61</name>
        <addressOffset>0x454</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.62</name>
        <addressOffset>0x458</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.63</name>
        <addressOffset>0x45c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.64</name>
        <addressOffset>0x460</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.65</name>
        <addressOffset>0x464</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.66</name>
        <addressOffset>0x468</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.67</name>
        <addressOffset>0x46c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.68</name>
        <addressOffset>0x470</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.69</name>
        <addressOffset>0x474</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.70</name>
        <addressOffset>0x478</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.71</name>
        <addressOffset>0x47c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.72</name>
        <addressOffset>0x480</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.73</name>
        <addressOffset>0x484</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.74</name>
        <addressOffset>0x488</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.75</name>
        <addressOffset>0x48c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.76</name>
        <addressOffset>0x490</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.77</name>
        <addressOffset>0x494</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.78</name>
        <addressOffset>0x498</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.79</name>
        <addressOffset>0x49c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.80</name>
        <addressOffset>0x4a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.81</name>
        <addressOffset>0x4a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.82</name>
        <addressOffset>0x4a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.83</name>
        <addressOffset>0x4ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.84</name>
        <addressOffset>0x4b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.85</name>
        <addressOffset>0x4b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.86</name>
        <addressOffset>0x4b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.87</name>
        <addressOffset>0x4bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.88</name>
        <addressOffset>0x4c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.89</name>
        <addressOffset>0x4c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.90</name>
        <addressOffset>0x4c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.91</name>
        <addressOffset>0x4cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.92</name>
        <addressOffset>0x4d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.93</name>
        <addressOffset>0x4d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.94</name>
        <addressOffset>0x4d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.95</name>
        <addressOffset>0x4dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.96</name>
        <addressOffset>0x4e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.97</name>
        <addressOffset>0x4e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.98</name>
        <addressOffset>0x4e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.99</name>
        <addressOffset>0x4ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.100</name>
        <addressOffset>0x4f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.101</name>
        <addressOffset>0x4f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.102</name>
        <addressOffset>0x4f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.0</name>
        <addressOffset>0x500</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.1</name>
        <addressOffset>0x504</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.2</name>
        <addressOffset>0x508</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.3</name>
        <addressOffset>0x50c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.4</name>
        <addressOffset>0x510</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.5</name>
        <addressOffset>0x514</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.6</name>
        <addressOffset>0x518</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.7</name>
        <addressOffset>0x51c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.8</name>
        <addressOffset>0x520</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.9</name>
        <addressOffset>0x524</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.10</name>
        <addressOffset>0x528</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.11</name>
        <addressOffset>0x52c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.12</name>
        <addressOffset>0x530</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.13</name>
        <addressOffset>0x534</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.14</name>
        <addressOffset>0x538</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.15</name>
        <addressOffset>0x53c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.16</name>
        <addressOffset>0x540</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.17</name>
        <addressOffset>0x544</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.18</name>
        <addressOffset>0x548</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.19</name>
        <addressOffset>0x54c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.20</name>
        <addressOffset>0x550</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.21</name>
        <addressOffset>0x554</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.22</name>
        <addressOffset>0x558</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.23</name>
        <addressOffset>0x55c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.24</name>
        <addressOffset>0x560</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.25</name>
        <addressOffset>0x564</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.26</name>
        <addressOffset>0x568</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.27</name>
        <addressOffset>0x56c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.28</name>
        <addressOffset>0x570</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.29</name>
        <addressOffset>0x574</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.30</name>
        <addressOffset>0x578</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.31</name>
        <addressOffset>0x57c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.32</name>
        <addressOffset>0x580</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.33</name>
        <addressOffset>0x584</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.34</name>
        <addressOffset>0x588</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.35</name>
        <addressOffset>0x58c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.36</name>
        <addressOffset>0x590</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.37</name>
        <addressOffset>0x594</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.38</name>
        <addressOffset>0x598</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.39</name>
        <addressOffset>0x59c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.40</name>
        <addressOffset>0x5a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.41</name>
        <addressOffset>0x5a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.42</name>
        <addressOffset>0x5a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.43</name>
        <addressOffset>0x5ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.44</name>
        <addressOffset>0x5b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.45</name>
        <addressOffset>0x5b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.46</name>
        <addressOffset>0x5b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.47</name>
        <addressOffset>0x5bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.48</name>
        <addressOffset>0x5c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.49</name>
        <addressOffset>0x5c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.50</name>
        <addressOffset>0x5c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.51</name>
        <addressOffset>0x5cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.52</name>
        <addressOffset>0x5d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.53</name>
        <addressOffset>0x5d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.54</name>
        <addressOffset>0x5d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.55</name>
        <addressOffset>0x5dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.56</name>
        <addressOffset>0x5e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.57</name>
        <addressOffset>0x5e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.58</name>
        <addressOffset>0x5e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.59</name>
        <addressOffset>0x5ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.60</name>
        <addressOffset>0x5f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.61</name>
        <addressOffset>0x5f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.62</name>
        <addressOffset>0x5f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.63</name>
        <addressOffset>0x5fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFENC_AC0.64</name>
        <addressOffset>0x600</addressOffset>
        <size>0x20</size>
      </register>
